ArmourStone/cases/case_001_simple_jet_2/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}

application     simpleFoam;

startFrom       startTime;
startTime       0;

stopAt          endTime;
endTime         500;

deltaT          1;

writeControl    timeStep;
writeInterval   100;

purgeWrite      0;

writeFormat     ascii;
writePrecision  6;
writeCompression off;

timeFormat      general;
timePrecision   6;

runTimeModifiable true;
functions
{
    sampleBedLine
    {
        type sets;
        libs ("libsampling.so");

        writeControl writeTime;

        interpolationScheme cellPoint;

        setFormat raw;

        sets
        (
            bedLine
            {
                type uniform;
                axis distance;
                start (0 0.05 0.05);
                end   (20 0.05 0.05);
                nPoints 201;
            }
        );

        fields
        (
            U
            p
        );
    }
}

functions
{
    sampleBedLine
    {
        type sets;
        libs ("libsampling.so");

        writeControl writeTime;

        interpolationScheme cellPoint;

        setFormat raw;

        sets
        (
            bedLine
            {
                type uniform;
                axis distance;
                start (0 0.05 0.05);
                end   (20 0.05 0.05);
                nPoints 201;
            }
        );

        fields
        (
            U
            p
        );
    }
}
